{
  "@context": "https://linked.art/ns/v1/linked-art.json",
  "id": "https://example.org/cdkg/LinguisticObject/presentation/10",
  "type": "LinguisticObject",
  "_label": "Textual content of \"Implementing Informed Consent with Knowledge Graphs\"",
  "classified_as": [
    {
      "id": "http://vocab.getty.edu/aat/300027388",
      "type": "Type",
      "_label": "Transcript"
    }
  ],
  "content": "Hello, everyone. Welcome to this talk on implementing informed consent with knowledge graphs. My name is Anelioa Kurteva, and I'm a PhD researcher at the Semantic Technology Institute at the University of Innsbruck. Currently, I am interested in my PhD in knowledge graphs, the semantic web privacy, GDPR, and human computer interaction, and how they can work together to solve issues such as, consent in, different domains. So let's begin. A bit of background information on GDPR first. So GDPR became applicable in May of twenty eighteen in all member states to harmonize data privacy laws across, Europe. GDPR's main aim is to give control to individuals over their personal data, and it introduced the notion of informed consent. And, also, GDPR views consent as one of its legal basis for data processing. But, of course, there are hefty fines for not being compliant with GDPR. Up to ten million or two percent, of the firm's worldwide annual revenue. So what is consent according to GDPR? So consent according to article four of GDPR is any freely given, specific, informed, and unambiguous indication, of the data, subject agreement to the processing of personal data related to him or her. And to be more specific, what is exactly informed consent? So before the data subjects grant consent, they should be married, aware of information such as who who is the data controller, what kind of data will be used, for what purposes is the data required, how the data will be used, how the data will be processed, where the data will be stored, with whom will be shared. And, of course, much more information that can be provided here to individuals so they're more informed. So here come two projects that I'm currently working on and that also consider, GDPR and consent. We have the company, project, whose goal, is to, develop an open platform on which private and public institutions can create different campaigns. And a campaigning company is a specific request for a data from individuals, and, that data will be analyzed. The main focus for now is vehicle sensor data, and, actually, company runs in Hanover, Germany. And the second project is the Smashfit project whose goal is to establish a framework, for secure and trusted sharing of, personal data and industrial data streams across different silos and, smart cities, for example, which I'll talk a bit a bit, further in the presentation. And, yes, consent in smart cities. So in a smart city, consent is, consent and also the data of the individuals can be spread across multiple different zeroes, which are databases, locations, people, and can be used for different purposes by different entities simultaneously. Here on the side, you can see, smart city domains. We have smart retail, smart mobility, smart health, smart government, education, smart homes. And, the other goal is to implement the consent, in a way that does not distribute the data flow between those silos while still being compliant with GDPR. And consent in smart cities is actually one of, the use cases that inspired the smart chip project, which you can also have a look at. So the main challenges that we've identified are, responsibilities. Who is responsible for what? Who records the consent? Storage. Where is the consent stored? What privacy and security mechanisms are in place? Who has access to the consent and also to the data? And can the consent decision of the individual be changed without the, his knowledge? Also, what are the implications of revoking consent? How can a user revoke their consent? And what happens to the data and the processes that, use the consent after the consent is revoked? And finally, awareness, awareness of what it means to give consent and the implications that follow. Some knowledge graphs, which I'm sure most of you are aware of, they can be used as a consent solution, and they have many benefits that can be related to consent, but, of course, are not limited. For example, knowledge graph provide transparency because data is bought in human readable and machine readable formats. They provide traceability, which when it comes to consent, is really, crucial because, it provides provenance, information. We can use different, ontologies for provenance events and time stamp, data. So we preserve the records of consent, when the consent decision was made, when it was changed, and more. We have also knowledge discovery. We can discover different patterns and consistencies, security and privacy issues. We can perform reasoning on knowledge graphs, which is especially useful for GDPR compliance checking. We can understand connections between data. For example, how a third party gain access to specific user data. And, of course, knowledge graphs provide a common understanding across all entities in the smart cities of the notion of consent and many more concepts that exist in the domain. So we performed a survey, which you can check to have, input to the reference on semantic models for consent. And, of course, work has been done through the years, and several ontologies exist as you can see. However, we've identified common limitations. There these ontologies are either too general because, they're part of project, and these projects have their own use cases. And this the ontologies also focus only on these, use cases. The ontologies, yes, they represent only consent sometimes, which, means that no other information about the data itself, or the processing that's applied to the data is modeled. And, some of the ontologies, do not model consent state state changes such as revoked, withdrawn, etcetera. And, most of the ontologies are not open access, which can complicate their reuse. Current goals of, the projects that I presented, Kompano and, SmashIt, is to implement the life cycle of informed consent with knowledge graphs. And when we say life cycle, we view, here on the side the different steps that can be undertaken when dealing with consent. We have the request of consent, the comprehension of consent, the decision about consent, and the use of consent. And all of these, stages also consists, of, different sub steps that can be taken, different, tools and approaches that can be adopted when it comes to the management of consent at each stage. And the next goal is to raise the awareness about what it means to give consent and the implications that follow. So the first step that we took is to model a sample, a campaign in the company or project. The campaign is called, and it's actually a real campaign that was run by the Tyrolian government here in Austria, a couple of years ago. The main date of interest in that campaign was to, GPS data from car drivers in the area of Innsbruck up to fifteen kilometers away, and the data was stored anonymously in a central database in Kuchstein or by owned by the government. Upon the user, consent, the data was, or will be also, up to today, shared with, STI Innsbruck, which is my research group, and we run different processing connect. So based on that simple campaign, we created our, main ontology and then, we added data and created the the knowledge graph, which you can see here. It's quite simple and represents currently only one campaign. Rosa Finn's book has presented earlier, and we have the different data associated with it when the consent was asked. So we have the status of consent, which is, given. We have the duration of campaign, twelve days. We have the main purpose, which is for fraud detection. We have also who requested the campaign, which is the Innsbruck government. We have the type of data, GPS data, and, of course, the person who gave their consent. And while this data is really, easy to understand by machines and experts both in human readable, machine readable format. How can individuals with no knowledge of linked data understand this, model? So we decided to visualize the consent first, and, we began by analyzing existing consent request user interfaces. Some of the issues that, we came across are information overload, privacy and policy privacy policies written in technical and legal jargon. As you can see here on the side, we have long documents and legalese that people rarely understand and read. We have consent requests which are which are not really compliant with GDPR because no information about, the consent is presented. For example, why is the data required? Why is the data, what is the purpose of the data, how data will be processed, where where the data will be stored, and more. And, also, these user interfaces, do not clearly indicate that the individuals have the right to, revoke their consent, which is also known as the right to be forgotten. So we, created, a simple user interface for the company or project, which displays the different campaigns, which you can see on the side. Or it you can see campaigns from different companies. The UI was developed with, Google's new UI toolkit called Flutter, and it follows the, consent knowledge graph which we, shown before. And the UI is designed to be used in vehicles, for example, on tablet or a phone by the individual. Here, you can see more details about the actual campaign the details when the user selects the campaign by by, Volkswagen. You can see the, company name, the campaign, roads of Innsbruck, what data will be collected, when is the start date, the end date of the campaign. And further, when the user selects to agree to participate in that campaign, we present them with, preference, lists. So the user can select really if they want to share all of their data that's asked for or only GPS, tire pressure, speed, and then finalize their consent. But then, we were, thinking of how to even further, help raise the awareness of individuals. So we decided to focus on visualizing of, what happens after the consent is given. And for that, we use, again, the knowledge graph which we have with the different campaigns as the main source of information and the d three, visualization library. And, we actually published a paper in June this year. You can, have a look if you're more interested, which focuses exactly on this topic. So we presented individuals, with, this, user interface. In the middle, you can see this is the vehicle from which, the data is transmitted or the individual itself inside of the vehicle, and we have the different campaigns that these individuals participates in. For example, green future, drive smart, highway zero, and each campaign is associated with, different, types of data. And we use color blocking to identify that. For example, speed is in yellow, GPS is in purple, and we have also a team change from light to dark. You can actually test the user interface, here and play with it for yourself, see if you like it, and maybe you can even, provide some feedback about, future improvements that can be done to it. So when the individual selects a campaign, for example, green future, they're presented with a bit more detailed, information about this campaign. Specifically, what type of data was, retrieved at what time and by which company. We performed some user evaluation. We had twenty five participants, female and, male, age eighteen to, fifty five, with different university degrees, and eighty percent of them had a driving license. Evaluation details you can find in the paper. So, we asked the same questions about consent before presenting the individuals with the UI and after. So, before, we asked them if they're willing to share their GPS location and other types of data with companies, and most of them said that probably, not and never they would share such data. And after we presented them with a visualization of what happens to their, data after consent is given, most of them actually changed their opinion and said that possibly, they would if they had this, tool. Next, we asked them to, describe the interface with some keywords. They said it's organized, effective, innovative. We also evaluated the comprehension of individuals. We asked them if they can easily see what's happening to their data at specific times, and most of the individuals strongly agreed and agreed. And, when asked if the graph helped them understand what happens to their data, most individuals, again, agreed and strongly agreed. So the main takeaways from our evaluation are that visualizations help increase the comprehension of what it means to give consent and, trust of the users. And that, the application that we created creates more transparency, the data sharing process. Here are just some examples of, future things that, I think are also important to want to consider. For example, consent standard standardization. I think that the W3C consent community group is currently working towards different, and better solutions for consent so you can have a look there. Also, what happens, beyond GDPR because GDPR, yes, it's a a really huge law, but, in some places, it does not apply. In California, for example, we have the CCPA, and other countries have their own laws about consent. And when in some cases, consent might not be enough, and what happens then? Maybe contracts and licenses can come into play. So these are just some things that we can all think about. And if you have any suggestions or you want to discuss, feel free to reach out and send me an email or even here in the chat. So So thank you very much for your attention, and I'll take any questions now if you have.",
  "language": [
    {
      "id": "http://vocab.getty.edu/aat/300388277",
      "type": "Language",
      "_label": "English"
    }
  ],
  "created_by": {
    "id": "https://example.org/cdkg/Creation/presentation/10",
    "type": "Creation",
    "caused_by": [
      {
        "id": "https://example.org/cdkg/Activity/presentation/10",
        "type": "Activity",
        "_label": "Presentation of \"Implementing Informed Consent with Knowledge Graphs\""
      }
    ]
  },
  "digitally_carried_by": [
    {
      "id": "https://example.org/cdkg/DigitalObject/recording/10",
      "type": "DigitalObject",
      "_label": "Recording of \"Implementing Informed Consent with Knowledge Graphs\""
    }
  ]
}