{
  "@context": "https://linked.art/ns/v1/linked-art.json",
  "id": "https://example.org/cdkg/LinguisticObject/presentation/32",
  "type": "LinguisticObject",
  "_label": "Textual content of \"Secret Knowledge: Visualizing Complexity\"",
  "classified_as": [
    {
      "id": "http://vocab.getty.edu/aat/300027388",
      "type": "Type",
      "_label": "Transcript"
    }
  ],
  "content": "So today I'm gonna make a presentation about complexity and more specifically tailored, towards like around visualizing graphs because this is a conference about graphs. But this, format is gonna be a bit, different from what, you're used to, I think, because I want to make a presentation and and to be very interactive, meaning that I will ask, questions. And depending on how you choose to answer, we will go through one or the other way. So it's very easy to do. Basically you just go here, you can scan if you have a phone, it's even better. You can just either you can join slido dot com and you put the data art as a hashtag or you can just scan it with your phone and it will automatically join. And so it's pretty cool because you will see that the results as you vote, are completely integrated in the presentation. So it's it's pretty cool as a as a feature. And I will ask you just to make sure that you're ready and to know a bit more about you. You this is the one what it looks like. Ask a question, and you can see on the left, you can always join, the present, like the presentation and the polling part. And so this is like a question because we're gonna talk about visualization and especially around graphs. So it's a good idea for me to, you know, try to adapt also the content and see, as you can see here, we would see in real time how many people vote. And it's cool because you see people are fighting. You can also edit your answers as we will go as we will see in the in the next slides if you want to, you know, go back and forth. So we have eighteen people out of I think fifty three. So let's let's get everyone, you know, get everyone on board And in the meantime, so, yeah, this presentation is really about, data art and I'm not really sure if you're familiar with the field. So I'm gonna first try to introduce what is data art, the difference between data visualization and data art, go through different example of graph visualizations. And, if you have time, if you are nice people, we'll also go towards, another kind of work that I do with more with with ai which is about neural networks. It's not exactly a knowledge graph, but it's still around networks. So it makes sense to talk about this here and at the end also have another surprise. So, let's try to have a bit more people. We have twenty five people. You can just join us. Go here on the website, put the hashtag or just scan here, the the QR code with your phone, and then it's automatic. It's gonna be refreshed automatically. You don't have to do anything. It's just, it gets automatic. And if you're not, if you don't have time to join now, don't worry. The next question, you always have this left panel so you can always join in and, you know, participate. So from what we have right now, we see that most people so you, you dabble, right? So, you know, about database and some people like really, like seven percent of, of people, people really like my life revolves around data and visualization. So you guys are really expert, but, for most people I think it's going to be pretty new. We know I have an idea of what database is and, but we want to know more. So let's, let's begin, just to quickly introduce, who I am quickly. I have a background in data science and, I also, and are like switched after my PhD in more into data visualization. But, today I'm going to go and talk about data art, which is something that I've been, like doing for, I'd say seven years now, professionally. So I basically earn money selling data art. This is, like, the definition of professional. Right? And, so this is gonna be we're gonna be focused about the work that I did on on data art and and then it relates to, graphs because, I did my PhD in graph visualization, basically. So it's gonna be very well connected. So I just wanted to introduce how I really started, you know, to, play and and, you know, work about data visualization. This is an actual picture of my board back in the day and you know, people were asking me, hey, what are you working on? You know, this is like the classic. If you do, like, a thesis, people ask you that all the time. And I was very naive at that time because I thought people were actually they were really interested in knowing the answer. So I was like going go straight to the board, trying to get a look, this is what I do. And then I realized this was just, you know, they were asking me just out of courtesy. So I was I was like a bit frustrated, but I realized, okay, maybe if I could, you know, try to visualize what I do, people will get more interested because you know, you can see it and it's not about math or code or anything. So this is how I started and get interested into the field of data visualization itself. So what is database? Basically, if I were to, like, an outline of three points, database is about to, it's to be the most efficient effective in communicating statistics or objects or numbers in a visual manner. Right? So the keyword here is to be effective, which is different from data art. So you want to have to minimize the time it takes for other the audience to understand what you see on the screen. For instance, here we see a map with dots, we see bar chart, a line chart. And just by, looking at the legend or the the title, like the description of the chart, it should get pretty it should be pretty easy to understand what it is. This is the goal of database to communicate, but also to explore. If you work if you work as a scientist, you you have no you have a big dataset. You have no idea of what it is. You're gonna start by creating some, you know, basic charts just to get your hands on the data, understand what what's the distribution, the length, the size, the clusters and so forth. So it's a very good tool to explore. But basically all in all, the point is to develop one's cognition about the underlying dataset. So this is like my definition of database. Now if you know a bit about database, you can, like look up on Andy Kirk's like website. Yes. Yes. Like I don't know, six hundred different tools, like everything that is related to data visualization. Most people here will be familiar I think with the tableau or power bi or click like there are three main competitors in this space. So So basically, if you're not really familiar with database, you take the tool, right? You go, here, this is tableau, you have your data, you drag and drop on columns row up, you have a chart pre made for you, you try to color, you put the time and that's it. You are doing data visualization. So why do we need to go beyond? Why do do we even care about creating custom data visualization when you have like good software that do it for you automatically and very efficiently. Well, all in all, it comes to impact. If you do like dashboarding all the time, it's difficult for people, you know, to have something like to remember the visualization to be remembered by because it they all look alike. So what if you work in database, you're striving for impact. So you want to be impactful so that the message that you communicate, the story that you tell, you know, helps people, take this new decisions or reason about their businesses and so forth. So if you want to have impact, what do you do in general? Some people, you know, they go on the street and they protest. I come from France. This is our specialty, as you all know. So then when they go on the street, they try to protest to influence people, right? This is one way, I'm, I'm trying to do the other way. So this is supposed to be a mirror and I'm more, you know, maybe, you know, Michael Jackson, man in the mirror song. I'm I'm think if you want to like influence people, it has to come from within and to do that, what better way than using art to do so? Because art is very subjective in its nature. So if you can, if you're touched by a piece, you can really, you know, it can change your the way of thinking and how you perceive life in general. So instead of doing the protest because I'm alone, I cannot really organize anything. Maybe we should try to go more on the artistic routes because it's less frightened, frightening. It's very deeply personal and you can have a greater greater impact. So this is basically how I, you know, started and doing data art and say, okay. Maybe if I can do a piece and I can have more impact, then my goal is complete. And my goal being as a scientist, try to communicate science, make people understand complexity, such as, like like, understand how graphs work, the connections, and so forth. So this this, like, was the whole motivation here, and we're gonna talk about this. So, basically, if you look at at this particular piece, you have no idea what it is because there is no description. And, but you you believe me when I said that this is based on data. So what is data art? If we are to, you know, give a definition, data art is not data visualization because the goal here, the most important part is to create emotions. So first and foremost, you want to maximize emotions. And hopefully for instance, if you see the piece here on left, you want to get closer because maybe you like the colors, maybe you like the shape. But as you can see below here, you also have a description and this is where the artistic message comes. So in some pieces you have no description at all and it's up to the viewer to understand what's what's really happening here. Data art is different because it is based on data. It has a more objective truth than the solar arts. It's imagination. Right? So basically you get it attracted by the colors, the shapes, so forth. Then you read the description and hopefully you reflect on yourself. This is how the message gets to you. And all in all, back to the same thing that we have in database, we develop cognition about the underlying dataset, the scientific principles and other types of things. So this is basically my definition of data art. I hope that it was clear the definition between database and data art. And you could you could like, you know, ask me, okay, why are you are you the only guy doing this data art? And I'm not. This is from a paper from back in the day two thousand and seven on the database conference. You showing the merits of doing artistic data visualization. So this was, like, something that people noticed, like, even even before that. But, you know, trying to understand, explain that if you put emotions, you have a greater impact and people find the charts or like the images more memorable. And so it's actually a good thing to have visual embellishments even though it makes maybe sometimes the data a bit less clear to perceive at first glance, but because it has a greater impact and they can measure that, all in all, it's better. So this is how I try to also connect the artistic part with the, like a field of research as well. So if you are interested, you can, look it up. But basically, how how does it work? What what is the design process to to create some graphs and art with graphs? For instance, what it's very similar if you come from a design background, this should be very familiar. It's exactly the same as database. It's gonna be interactive, meaning that it's not like, oh, I have an idea. I'm gonna work two weeks and then that's it. It doesn't work like this. It's sometimes the most frustrating part is, like, sometimes in two hours, you have you have you actually have the final design, but you spend three weeks refining the thing just to go back to the first one because the client likes it. So it's it's iterative. But the question that you have, you ask yourself is like, are you going to create a static piece, like an image? Is it going to be animated? Maybe it's going to be a video. Is it going to be an interactive data visualization or data art piece so people can click or have like sensors to make it move in real time? Is it gonna be abstract or figurative? What are the different shapes that you can play with? What are the dimensions that you're going to take in the data, the clusters, the different techniques and have to strike the right balance between order and chaos. So exactly the basically, I would say the the things you have to take into account and colors. Of course, people like to do black and white. I like to do colors. So, and because it's data are they have to mean something. So if they have the same color, they should belong to the same cluster for instance. And, so they have a mean. So, basically, if you had to say, like, to describe my job in one side would be data, some code, and basically you create a visual that that that means something. I hope that it's like one data art in one side. This would be it. So now I wanna go back to the example that I showed before, and this is about the Montreux Jazz Festival, one of my favorite examples. So if you're not familiar with the Montreux Jazz, this is one of the most famous music festival in the world in Montreux. Montreux is in Switzerland. And, just to give you an idea, it's pretty big as a festival. It has been going on for more than fifty four years now. And is that it has eleven thousand hours of videos with different cameras, six thousand hours of audio, more than a hundred thousand pictures, but and, basically, the dataset is two point seven petabyte and, like, spread across two different dataset cooled by the water of the Lake Geneva. So this is like the the data we have to, play with, which pretty big. Right? And basically what I I tried to make some visualization to give you an idea of what you have in the dataset. Here, each dot here is an artist that played at the Montreux Jazz, with this, his location, its location. And you see that the the notes here have different shades. They're more, like, the more purple you are, it means that the more connected musically to the other artists. So you can ask, how do you compute the musical similarity between artists? And to do that, we have to analyze the sound itself. And remember that mantra is a whole new setup. It's not the same as the studio version. You have to analyze the rhythm, the melody, the notes, chords, harmony, things like this from the reading, the signal, then try to compare songs together and see if this sound alike, and then grouped all these songs by artists. And this is how you get artistic similarity, which is pretty cool because people have been using this particular map, for ethnomusicology. So to understand the origin of music, for instance, here would be Bikin, which is the most famous festive, like, musician and the jazz and see how he influenced with blues, you know, other people that came in the festival as well. So this is an example of a database. This has nothing to do with art, but just to, as I said before, to give you an idea of what, what is the dataset, and then we progressively move on to the more artistic part. Another visualization that we have, this is about the evolution of musical genres over time in the Montreux Jazz. So as you can see here at the beginning, it's like the the curve is really narrow because we only have, like, the festival was basically three days in one, like venue. But at the end now it's supposed to be fifteen days in three different stages. So we have more in terms of volume and more songs, getting played each day. And what's also interesting here is that the proportion of jazz, which is the pink one in the middle is more or less constant over time, but we add more and more different musical genres. So it's not about jazz anymore. Even like back in the day, as you can see, you have hip hop, reggae, metal, electro and so forth. So it's really like a very international music festival even though it's, you know, it's dead centered around the the jazz. So this is a bit more abstract. This is called a stream graph as a visualization, and it shows, like, the evolution in time with the width being proportional to the number of songs. And now we I want to go back to the image that you saw before, the very which is about the artist of the jazz itself connected if they've been playing together on stage. So basically you concatenate and you you flatten all the concerts in one dataset. And because, you know, artists, they tend to come several times at the Montreux Jazz and each time they come, most of the stars, they come with a new lineup, a new bassist, a new drummer, a new singer, sometimes if you're like a guitarist and so forth. And so you can connect all the different artists of the jazz if they play together, on stage at a certain point in time. And this is what we had here. So this is like a very nice, simplified schematic, but if you scale it to the, like, whole dataset, not the whole dataset, but like the most interesting part at the center, you would see here, all the connection, the big yellow dot here is Vivi King. You have Santana here and George Duke and you see that all the lines seems to converge at the center. And it makes sense if you think about it because the artist at the center are mostly jasmine and blues men because it's the montage jazz, but also because the music itself, you know, calls for collaboration, you want to jam with other people. So if you're a Jasmine, you will change you. And each time you will come up with a new quartet quintet. And this way you have, you get very connected at the center. So all the lines seems to converge here, and you can be very popular as an artist. And I've just played here in this small cluster with your band. But if you didn't really mix with other artists, you will not be connected at the center. So we have this, what we call the Montra jazz galaxy. The whole piece was called jazz luminaries and it was displayed in this, full dome. So it's like a small, very small planetarium. And we also, created this controller here, which is actually a phone inside where you can, you know, play around. So it was interactive. You could select an artist. And when you click on the artist, see all the different concerts and then listen to all the songs. So imagine being able to listen to more than two point seven petabyte of data in your fingertips. So it was pretty cool as an experience. I want to show I I can only show you, like, part of the video because everything is copyrighted as you can imagine, but it would basically look like this. People will, you know, lay on the floor and have this weird controller. And as you will move it, you know, in space, you would create this fisheye effect and on the three d, like graph that you see here with all the different, pictures. And then if you click on the the most, the selected note, you would see that everything will slide and all the different concert for this artist would come up. Then you click on the concert and you'd be able to browse the different tracks. So this is, I hope that I know it's a bit, underwhelming because you cannot see the whole experience, but I hope that you get the idea through this, like, smaller video. So this is, like, the the the two d, render of the three d mesh that we we saw before. And then what we saw just before the BB King stuff is we get the center here. I hope that, this example, and it gives you a better idea of what data art is and how we can go from the the old data, the data visualization, and then create something more abstract, which has a story and and to arrive to this particular piece. But now I want to get back to what I said at the beginning. And I said at the beginning that you were there here, right? So maybe you recall those books back in the day where you, you know, if you want to make this decision, you go to page eighty four and then you, you turn left and you die. And most of the time you have to go back to the beginning of the book, but we're not going to die here today, but you are going to be the hero, meaning that depending on what you choose, we will go through one of the other different artworks. So you are in control of democratically of what we can do here. So I will first ask you to pick a shape. So I'm gonna ask you this question right now, here and it should appear on your phone. And so let me and to make sure that it's true, we can also see in real time. So I'm not cheating. You can see that you can change. It's up to you. So we have thirty seven people voting beforehand. So let's, let's try to have a bit more today. And now in this particular question, what's really funny about this is that depending on the demographics of the crowd, you have different choices. I give one of, like, kind of this talk in the US and in Europe, and it's it's always different. But Square, you know, just really seem to be, like, no one likes square. Either a circle or a triangle and you see people are fighting. If you if you're at a square and you feel alone, you can also edit your answer and choose one or the other because sometimes you have like a it's a perfect match. So I have to choose it randomly. It's not not because I said that square has no love. People are gonna going back to edit the answers and and, you know, changing and go back to square. So this is really, you understand how politics work politics work, right, with this kind of line voting and stuff. So okay. I think so. Circle and triangle. So if none of the square, okay. Triangle is a bit better. So let's go with the triangle. So sorry for the circle. Sorry for the square. Let's talk about this one. So if you look at this particular image, basically, you have no idea what it is. Exactly the same story as what we had before. But what you can already notice is that we have different kind of cluster, which seems to be connected, but, like, still well isolated in different colors. So this particular piece is about papers, papers and patents, actually. And this was a collaboration with the professor at at EPFL working on the in the like, it's a knowledge graph really. And and this field of study is basically knowing, like, innovation, how and how we relate technological products that we have, like an iPhone or anything, to the the research that, you know, originated from, for instance, papers back in the fifties will which led to, like, transistors, screens, and so forth, and to have in the end the technological products that we have in our hand. So all the story of how innovation, you know, evolves in time. And so basically, sorry for the French here, but what you see here is a connection between patents. So if you have a white, border, it means it's a patent connected to papers. Because when you file a patent, you basically need to do the prior art and, you know, you can cite other scientific papers. So it's really interesting to see how long it takes for a scientific paper to get in per field, you know, to get cited and how long it takes to get patents. Sometimes you have tons of new patents which are not connected to scientific papers. So you are really wondering, is it really innovation? Is it like a radical innovation? Is it a very well kept secret? You know, so you all these kinds of questions. And as you can see here, all the nodes are lined up according to the time, basically. So the the last, state the the last story was is, on the fifties and below. So it starts really, like, back in the day, I would say. And here it's two thousand seventeen, I think. So this is like the when I got the dataset, basically. And you can see here, this is about computer science. This is electronics. This is cosmetics. And each time you have a different, I think, thirteen different fields of research. And you can see, like, for instance, computer science, you know, sites more papers and that it goes deeper here. So So it has more ties to scientific research than cosmetics, for instance, here or it's it starts to vary like very this is maybe the eighties and you have tons of patents and less papers. And here, as you can see, we have few white notes, but tons of black notes or black borders. So it means that more research than patents, for instance. So this is, like, the kinds of, like, knowledge that we can extract from this particular, not necessarily this visualization, but also the the dataset itself. It's really interesting because it is based on the the patent office in Bern. It's it has more than eighty million patents. This is, of course, just a small subset where we have we we actually we make sure to have also the link to the scientific papers, It's not easy to do because you need to parse, you know, all the NLP natural language processing to match the authors, the name, the themes and so forth, which is quite difficult to do, but really interesting as a as a field of research. So this is this was one example. Let's move on. Let's take another ask another question. Now we'll ask you for a color and you have to vote, you know, your favorite color green, blue, yellow or red. And, according to your choices, we're going back to the to the piece that matches what you chose and talk about it again. Blue is always, one of the, like, crowd's favorite. I think I don't know. It's okay. I don't want to influence any of you, but I think that we have a clear winner here with the blue. So even though you can you can still change your choices, but I'm not sure we're gonna talk, you know, the, the blue choice. So let's go. Let's, let's talk about blue here. This one this one is actually I'm not sure if it's my favorite piece, but I think it is. So this one is a very personal story, for me. But once again, just think about it. You have, like it seems like the nodes are so small that you don't really see them anymore. You only see the edges. You see there's like there's like a a cluster at the center with blue and red. And maybe you saw this picture. It was, quite popular back in in the day. This one is about Star Wars. Star Wars before eleven, you know, the new episode seven eight nine. Okay? So we forget this and we go back to the real star wars. This is about the star wars character. Basically, what we did here was to crowd, you know, scrape Wikipedia, which is the Wikipedia of Star Wars and try to extract the the all the all the characters of the universe. And maybe you're not like, you know, maybe you don't, not a diehard star wars fan like me, but on this Wikipedia, you have more than one hundred and sixteen thousand pages created by hand by users describing the universe. It's more like forty years of, you know, data of books, video games, comic books, series, everything related to Star Wars. People that make all the description and so forth. So it's really, like, very complete as an as an archive. And why is it really important for us? It's important for us as humans because all the con the corpus here is already digitized. It's in English. It's quite easy to, you know, extract. Where and but the thing is if we can develop the tools to, you know, match the characters and how they progress in in time, because you have, like, star wars era spends over thirty seven thousand years. So it's pretty big as a universe. We can develop the tools and then apply them back to our own history. But the thing is with our own history, most of the manuscript are in ancient language, who are difficult to to read. They are not digitized. So it's it's much easier to start first with a fictional corpus such as this one, and then go back, develop the algorithm, and then try to apply them, on our own history. This was like the motivation. But the real in truth, the real thing is because I love Star Wars, but, you know, I have to keep appearances and say that this is really for us, but I love Star Wars. So what you see here is a whole different characters. And for instance, at the center, you have Darth Vader, Luke Skywalker, David Palpatine, Han Solo. And in yellow here, the yellow nodes are the criminals, which are actually very common in the Star Wars universe. You have Chabalahat. And if you look at his connection, the he is mostly connected to other villains. So people from the dark side of the force in red versus the blue one, the blue guys, the republic or the the jedi's and so forth. So you have this, you know, duality between light and dark side as you can see here on on the screen. Back in so when I did this piece, I think it was in two thousand fifteen, we had more than twenty thousand characters, but now we introduced new episodes. We have the Mandalorian, which is great, with also new characters and so forth. So you can the the universe expands as we progress. Right? And so we we could redo the same work and see how the the the universe would evolve. So this was about Star Wars. Now let's continue. Another question. This one is a bit tricky. I'm gonna ask you whether you want to, you know, if you you feel adventurous or not, and, you feel like opening a Pandora's box, you know, I tried to come up with creatives and I and we see people are, you know, they, they want to risk everything or they, you know, they are more careful. Okay. I think it's pretty clear that you want to see what's inside. So yeah, I think that there's no, people are very, you know, daring. Okay, fine. So you're daring. I wanna talk about this piece here, which, is also about, you know, knowledge graph. And, this one, it's it's interesting. It was also made for a company, and this is about LinkedIn. So this is what you see here are connections between people connected on LinkedIn. And it was really interesting as, insights because so basically how you create this, you go to your connection tab, you can now, everyone can do this on. You can export your data. What I asked is, like, the the people in the company that were willing to all of them export this, remove all the IDs and and and the identifier, like and try to merge everything. So we have, like, the corporate network of the people working in this particular company. And what's what's really interesting is that we could, you know, yeah, let me ask you the question. What do you do you think that people are if you work in the same company, do you share the same network more or less or do you have your own network? Right? It depends. You would say maybe if you work in a big company or international company, you don't know necessarily the same people. But in this particular case, it was about, a digital agency in Switzerland. So I thought that people were, you know, in Switzerland, it's quite small, so everyone will knew each other, but it's not the case at all. What you see here, all the the the notes here at the center are the people from the company. And, the notes that you see at the outside are their connections. And what we are really interested in here is to see how the percentage of overlap. And we found out that only six percent of connection were shared between the employees of the same company working in the same sector of activity Was actually quite surprising. I thought it was, you know, everyone knew each other, but it was really not the case. So in terms of story, it was really interesting for the company itself because now you can say, look. We we bring people from everywhere in Europe and each time they come, they bring their own knowledge, their own network. And, yeah, let me show you the proof. Here it is. We also analyze like, like tons of different stuff about, you know, managers and like very something that HR would love to to have, and this is what we did. But I think it was striking visually to see, we see all the different members and see all their their connection then that we don't necessarily see tons of overlapping here. You have some small edges, but not that much. Only six percent, actually. So this was another, interesting project just to show you the closed box was, exactly the same network, but the previous iteration. So it was exactly the same network. But, you know, it's, this is where I started from this image and try to, you know, expand and to create something a bit more crazy. This is, I would say, closer to what you would have in, you know, abstract modern art, and this is really purely digital. There's no doesn't really have any, ties to another art or the older art movement. So now okay. As I said before, I wanna talk now a bit more because we I think we have a bit of time. We have, thirteen minutes left to talk a bit more about, AI because, okay, it's still related to to networks. Right? But it's also very creative. And I hope that maybe I you know, if I I can, show you some creative applications of AI, it, it makes you wonder how you can also explain that to your clients or other partners because here we all work in tech. But if you talk about AI for the general audience, it's about, you know, terminators and that robots are gonna kill me. I'm gonna lose my job. And I want to change this because this is not entirely true. And there's like very good things to talk about with AI, but, and showing something more creative, you know, it helps people, you know, understand how it works. And they are, as once again, they are not frightened by the technology and they want to embrace it. And I think that's a message in terms of impact, it's much more powerful. So something that you're also very, like, it's very common. It's using generative adversarial networks, GANs, to synthesize new images such as this one. If you go to this website, this person does not exist. Basically, each time you refresh refresh the page, you would synthesize a new face, which is almost, like, photorealistic. Here, the hearing is a bit, weird, but I think new iteration, if you get lucky, you cannot distinguish the real from fake. So, basically, you have a a network that synthesize fake images, and another network tries to to check whether this image is real or fake. And once it's trained, then the network cannot make the difference between real like training data or fake data. And this is where this is how you can create some, like, photo realistic image. Now this is not very creative. This is about face synthesis. So how can we use the same technology to to create something more interesting? I will first ask you to vote whether you are more a micro or macro. So let's see. Okay. If other people will have the chance to, you know, change their answers or not. Okay. Well, I think we we all agree on Macron now, so let let's go. Now if I if I had to tell you if I, in fact, told you that you can actually, train a network on a thousand different objects, and then you can compose them to synthesize a combination of the object that you see. Now that you have this particular image and you have, like, a weight of fifty two percent for a mask, a crab, gorilla, space shuttle, birdhouse, coral reef. You know, all these ingredients that you see here, you can combine them to and synthesize a combination of them. So just look at all the ingredients that you see here and trying to imagine something. I think it's gonna be pretty difficult. I'm not even sure if you know, I like I don't even know what what this was or, you know, But this is what the the power of AI. This is where we can use it as a tool to, you know, sparkle creativity and get surprised by the results. So, basically I combined the old, all these ingredients and this is the result. And to me, this looks like a more like a macro shot, you know, of something that it's both insectoid and our same time, like plant, you know, vegetable or something organic at the same time. So you can create very abstract shapes as well. Right? We saw like very realistic faces, but it's all about the training data and how you combine all the elements. So this is, this was a still image with the different elements. Now I'm gonna show you videos and see how you can evolve and, you know, make this whole animation go very smooth. So but first, I have to ask you, you know, the drill. Once again, whether you're more like the sea person or land person. Oh, it's funny. You know, most of the time, people, like, choose the sea, but, it seems like we have land people here. So you're more, you know, far from the sea. So okay. Maybe I'll let you guys vote to change your mortgage. So let it is. So I'm gonna this is a it's a video synthesized with AI. So I'm gonna mute myself and, you know, pass the the the it has some custom music made for the video. It's on YouTube. You can also watch this at the end, like, on your own. Try to to see if it works. The full video is in four k at sixty frames per second, so it's pretty nice as a resolution. Let me try to to play it to you now. Alright. So this, video, is called and this animation is called evade evading confinement or lockdown. This was created at the beginning of, lockdown. So the idea was, you know, to create, surreal landscapes and then move according to your mood, basically. All of so the quality was not really great, but, if you watch it on YouTube on your own, I think that would be much better. But you see how smooth the transition were because you can really synthesize all the intermediate image images that you need just by moving the weight just a tiny fraction. And and so that it makes very nice, animations over time, which I really like. So this was an example of a video made with AI. This is like another, like, the other choices that you didn't select. As you can see here, you have the abiding confinement. This was projected on in Paris in e p seven, which is like a a hyperbar you see on the on the wall. So it's pretty big and was more than fifteen meters, wide and ten meters tall. And so it was that displayed here for ten days. It was pretty good, you know, to have the also feedback, people asking me what it was about. And, you know, once again, doing my science, work and talk about how it's made with AI. You see it's nonthreatening. It's cool and technology and so forth. And people were really happy at the end instead of just having, it's gonna replace you, your job and so forth. So I try to to emphasize and and show the positive outcomes of technology instead of, you know, just pointing out to to the negative. So that this is like a small video to to have an idea what it would look like. So but, yeah, to sit in this piece here. There was no sound, though. It was a bit shame, but, it's okay. So another application that we can create with AI is that now we can get inspired by the shapes that are generated by the machine and, you know, going back to inspire the database part or the data art part. And this is what I did here. You see, this is to me, it looks like a flower bouquet. Right? But but it was really inspired by it because I saw my network was synthesizing these shapes. And I I realized, okay, maybe I should try to, you know, take this knowledge, graph this network, and try to change it so that it will look like a flower bouquet. And you can zoom in here. Each dot is a person, and they are are connected to to their, hierarchy to to their boss, basically. So this is about a whole group. This is like the global CEO, and you have the top executive, and then you can actually go down the hierarchy to the intern of the intern of the intern and at the top here. And instead of having, you know, something top down, I'm the boss. You are my employees. The idea here was was as a CEO, I let my, you know, my what we do together makes, we grow as, as a company, but also as human beings. So this is more like a flower like shape instead of being, something very hierarchical. This was, like, the artistic idea behind the, the piece, but it was really influenced by AI. So this is how to go back to the to the knowledge graphs and so forth. So I think we have we have a bit of time. I think I want to show you one last, surprise. We have four minutes because, you know, what what have been presenting so far is really based on math. Right? You have either for deep learning or visualization or knowledge in itself, knowledge graphs. This is about, you know, doing layouts and stuff about math. So I have a an example to show you, something that you are all familiar with, I think, in theory, but you are maybe not that familiar with the recent advances of of this. So I want to talk about fractal art. You know, this is like very something that we see quite often. This is the Mandelbrot set. So a fractal is a shape made of parts similar to the whole in some way. This is the official definition and fractals are really omnipresent in nature. It could be in leaves and your heartbeat and crystals and vegetables and mountains and snowflakes, like everything is fractal. So this is what we have, like, a standard modern broad set. But the software that we have now is really powerful and can create very different looking shape. And to prove that to you, I will ask you to, you know, pick a side and choose whether you are more like an organic or geometric guy and and see if you are surprised by the results. So, okay. So it's almost fifty fifty, but we we can have more people. I think we can have ten more people voting. So organic. So you are very, like, interested in knowing how something so, like, mathematic and geometric could be more looks like more organic maybe. So let me oblige this. This is a fractal. This is pure math, mathematical function. And to me, it looks like a virus, you know, and it's was created during the coronavirus time. You can all, like, see that it's a fractal because at the at the edges here, you see that it repeats and repeats, it repeats, but at the same time, it looks very, you know, around and something that you could almost find in the, under a microscope, but it's just pure mathematical functions. Another example here, this called this one is called a brief. So it's about, the virus as well. And here, it's actually data fractal. So it was created five months after the the initial COVID you know, announcement. And you have five ring one, two, three, four, five rings. And the cool thing about this fractal is like now we are almost a year in the pandemic, so I can, you know, change the camera and create more and more you know, circle like shape like this so I can actually make it move over time And to me, it looks like, you know, blood flow and kind of like oxygen stuff. So, this was the idea behind the piece, and I always try to incorporate some small data so that it has more connected to the data art realm. Lastly, I want to show you this example, which is also a fractal, but to me looks like more like a sandstorm. And this was like a three d render, the three d fractal, but the render itself is almost, grainy with particles. And the old to me almost look like like a sense storm, something you would see in the mummy or dune or something like this. But once again, this is just pure, math. So I wanted to show you the contrast between, you know, what we think a fractal is in the Mandelbrot set and something we can which can be very organic. So to, to con I have one more video to show you. And, so this one is a combination of fractal and, data. So I'm gonna talk over it. What you see here is the fractal that moves according to the increase of sea level, and the data comes from the NASA. So as the sea level rises, we see that, the shape at the the center starts to grow, grow, grow, and if it grows too much, then it will, like, basically explode. So this is what you see here. And you also can notice that camera itself seems like to be zooming in and out very slowly, and this camera movement is also, matches the tide in France and some particular dates. So I try to parameterize everything that you see here according to data and try to, you know, use the this message to, you know, warn about the sea level increase. So something that is we are all, we're all in this together. So this is what the the main idea, and as we go back, then we smiled. It's a fractal animation. So this is my as I said before, try to influence both, merge two ramps of data and art at, in, unexpected ways. So to to conclude this presentation, I'm gonna I'm gonna ask you one last question, and then we're gonna maybe have time to, to take some questions. So basically just to let you know that creativity is the most demanded soft skills of two twelve twenty twenty and was also the same, last year. So if you are guys are interested to learning how to do stuff like this data art, I have a YouTube channel, and I also, you know, you can connect with me on different social media, and, I'll be happy to, to to talk it. So to conclude art upsets and science reassures. I hope that you liked this presentation. If you have any questions, thank you. I think we have some questions. Yes. Kiran, can you hear me? Yes. Okay. Great. Yes. We do have, unfortunately, we don't have as much time as we'd like to because we're already a bit over. But there is one specific question asked by Michiel, who's also one of our speakers that I just have to address to you. So, his question is, how can a little bit of FARC help in the process of designing commercial applications powered by knowledge graphs? It's a very specific one because this is what he does. So, he said that for their customers, it's often difficult to imagine that the different types of entities, allow different, and new perspectives. Do you have any advice on how to trigger that? It's a difficult question. How can a little bit of I see it in chat handling process of designing. Well, it's really about the message you want to communicate. Right? So it's difficult to automatize the art creation part. Unfortunately, I don't I don't have, like, a premade algorithm. I click and it's beautiful. But I think it it goes back to the story, right? If you can convey a bit of emotion, then your brain, basically the knowledge graph is read the left side of the brain, right? You about the logic, rationality, and so forth. If you trigger hard in the right side about knowledge about emotions, and basically you combine both of them, the feeling it's much stronger. So So you can use that as a way to convey that your solution is very interesting. It offers new perspective and so forth. But, it's not easy to do. We need to, you know, hand it's something as a handmade for so far. Yeah. That makes sense. Okay. Well, we'll we'll have to wrap up, because otherwise, we'll be eating into the time of our next keynote, which is also very interesting, which is done by Iran Avidan, from Intel. So our operator will wrap up this session. We'll keep your questions and try to address them to offline. So thanks once again, Kiel, then onwards with the rest of the event. See you. Thank you very much, guys, and I hope you liked it. See you soon. Cheers.",
  "language": [
    {
      "id": "http://vocab.getty.edu/aat/300388277",
      "type": "Language",
      "_label": "English"
    }
  ],
  "created_by": {
    "id": "https://example.org/cdkg/Creation/presentation/32",
    "type": "Creation",
    "caused_by": [
      {
        "id": "https://example.org/cdkg/Activity/presentation/32",
        "type": "Activity",
        "_label": "Presentation of \"Secret Knowledge: Visualizing Complexity\""
      }
    ]
  },
  "digitally_carried_by": [
    {
      "id": "https://example.org/cdkg/DigitalObject/recording/32",
      "type": "DigitalObject",
      "_label": "Recording of \"Secret Knowledge: Visualizing Complexity\""
    }
  ]
}