{
  "@context": "https://linked.art/ns/v1/linked-art.json",
  "id": "https://example.org/cdkg/LinguisticObject/presentation/38",
  "type": "LinguisticObject",
  "_label": "Textual content of \"Van Gogh Worldwide: Constructing and searching a knowledge graph of linked art\"",
  "classified_as": [
    {
      "id": "http://vocab.getty.edu/aat/300027388",
      "type": "Type",
      "_label": "Transcript"
    }
  ],
  "content": "Well, hello again, everyone. And, hopefully you managed to find your way in. Hope we didn't keep you waiting too long. It's a pleasure today to be introducing in, knowledge connection twenty twenty, someone I know for, well, over a decade, I guess. We have, the pleasure of having, Mihir, with us today from, Spinken. And Michiel and I, actually were colleagues for a brief while, back in Amsterdam, like I said, over over ten years ago. We were both in related areas in knowledge graph, what today actually is called knowledge graph. Back then, it wasn't called that, but you know, same same difference. The topic was still the same. His was more on the visualization and UI UX side, and I guess he's he's kept to that. And this is what he's here to talk about today as well. So I'll get out of the way and let me hear it. The only thing to mention to you, if you want to share anything, like questions, comments or anything else, by now I guess you know the process, this little chat box. I'll keep an eye on it and in the end of the presentation address your questions and comments to be here. So the floor is yours. Thank you. Welcome, everybody. Nice to be here and nice to see some familiar people in the participants , list. Alright. Can you put on my my screen share? I should pause that and then quickly switch to this one. You should be able to see my slides now. Right? So let's put it in full screen. So for Fog Worldwide, I'm going to talk about so this is a project you have been working on the last months. I work for a company called Spink. You see the logo here at the bottom left. We are actually in the business of creating search solutions for for knowledge graphs. And we're gonna have a look at how we apply that here for this project for worldwide. So before I say anything else, I should really give credit to the organizations and the people that were involved in this project. So here at the top, you see three cultural heritage organizations in the Netherlands. The one on the right, you're probably familiar with. And here at the bottom, you see some other companies, more technology companies, design companies involved in this project. And I myself, as I said here, at SPYNC. So there's three things that I would like to do with you today in this talk. Of course, we're gonna have a look at for a whole wide and, why are we doing this and how. Next, I want to make a, a claim for cultural heritage organizations to connect their data. And finally, we're gonna have a look at how we employ the concept of search design to access knowledge graphs. So let's start with Vincent. So physics for growth really is a worldwide phenomenon by now. So this is a visualization of his artworks where they are currently located. And as you you might wonder what what is here in the Pacific Ocean? Well, this is actually Honolulu in in Hawaii. Right? So it's really spread out to all continents all the way to Sydney, Australia. And what we do in projects like this is that we usually start from the end user perspective. So what are the search tasks that people are having for this type of data. Now you see here a picture, a little bit empty, as you probably can expect. During this presentation, we'll start filling the rest of this picture. But we start here from the right side. So what are the users here? Well, in this case, these are really professional users. So these are researchers, in the art humanities domain. And you have a couple of examples of research questions that, that they have from actual people. For example, Verhoeff painted several artworks from the family Houlain in France. So which members of the family did he actually paint? A much more complicated question is this one. So, for several artworks of van Gogh, it's not exactly known when they were painted. And sometimes also the order of in which they are painted was this one before the other one is not known. And finding this out is a big topic. And they use a lot of information from that. From this range is really from analyzing the paint, the actual material to the canvas, that it was was used for. For example, it's two paintings use canvas from the same role. This is, of course, an indication that they were created close by in time. Another picture, another question is actually, I think, for someone else attending now, is more sort of a social aspect, right? So how are the paintings of a book perceived throughout time, right? They are exhibited for more than a century. And how were they perceived? How were they exposed together? How was it how did people write about those paintings? And how did that change throughout the decennial? All right. So that should have given you an idea what we're trying to do here. So let's just go there. So you should see now, the website, and, let's try to start with the the simple question that you just saw. Let's search for, Now what you see here is six paintings made by. The first thing that I have to say is that these are actually not all the paintings by this family. Because at the moment, we have collected all the paintings, or all artworks, I should say, in in the Netherlands, from a dozen institutions. The second phase is, is currently starting. And in this phase, we're going to collect all the information from the other institutions. But already plenty to see here. But of course, this is not so spectacular yet. I mean, this you can also see see on Wikipedia. So let's dive into it a little bit more. So for example, this, this cute little boy, again, becomes more interesting because already here on the right side, you see images and becomes even more interesting if I open this because these are actually available in high resolution. So this means I can can zoom in and and look at these boys' eyes. And this becomes even more interesting if I start looking at more technical recordings of, of this painting. So this is what is called breaking light, where the light is shared on the painting from the side. And this really gives a good view on how Vergoc used his paint to to get all kinds of effects, right, the thickness of the of the paint here. Another thing that's very interesting is this canvas is, of course, stretched on a frame. And this frame contains all kinds of information. Right? So there are are label stickers on it that indicated who has owned this painting and, where it was, for example, exhibited. So here is actually one from nineteen twenty eight from an exhibition in Germany. Later in time, I guess they wanted to protect this frame and they added a cover on top of it, which when you borrow the the painting, you're not allowed to take off. So the more recent exhibitions actually have their, their stickers here on the on on this back panel. Okay, so let's close this high resolution few and scroll down a bit. Of course, there is object metadata about the artwork. But there's also various other things. For example, van Gogh has written a lot of letters to mainly to his brother, but also some to some colleagues. In his letters, he he often mentions his artwork. So the same for for this artwork. So you can read about, what he said about that. Who has previously owned these artworks, going from his brother to, to where it's currently located. And here we see those, those exhibitions. So what we saw there, the sticker at the background, on the on the frame in nineteen twenty eight is actually this exhibition. So we can click this exhibition and now see which other artworks were also exposed there. And so that gives you, a completely different perspective, on the artworks. Now there are various other things that you can, can explore yourself, after this presentation. So let's get back, to the presentation. So what we've done now, we've we've seen sort of the user side. So what's happening in the background? Of course, there's all kinds of data coming from, from institutions, and somehow we want to create a knowledge graph out of this. Now I want to approach this part of the talk from a sort of personal insight that I gained during this project. I've been working in in Credoheads already for, for about fifteen years coming from this technical perspective. But what I realized in this project is that there really is a wealth of knowledge in these this organization. So you can truly call them knowledge institutes. But what surprised me is that only a small part of this knowledge is actually available online. So, of course, these numbers are speculative that I that I present here. And this will not be the same for all. For some, this will be a lot more. But in general, there's really a lot of stuff that is not available online yet. What we managed to do with is to increase this. And so, for example, these exhibitions that I showed you in the high address, photos are now made available. So in that sense, FOCO worldwide has has helped to reach the full potential for for cultural organizations. But what I truly believe is that, for the cultural heritage organizations themselves, there is so much potential to gain if they start to, organize themselves around connected data. So not only just for sharing it to other portals, but also for themselves because it will empower them to do so many more things and truly be a a knowledge institute on the web. So, that's almost, almost a call out to these organizations. So how should they do this then? Well, this should start with within their organization. And so there's not just this collection management system from which you see a screenshot here on the left with this typical object metadata. That was actually the stuff that I have known for years. But there is so much more. And so you have already seen some of those assets. And some of the things you haven't seen is also x rays or infrared photography. There's really a wealth of information there. Then there was documents, literature, research reports, publications, all discussing and providing interesting perspectives. So the organization should really organize this and start connecting this data. Secondly, they should connect to external authorities. And there is a lot of knowledge inside, but outside, there is a lot that can complement this. And here you see a couple of examples for people in the cultural heritage domain, probably familiar with something known as the art and architecture or in short, AT. This provides very rich information, for example, about materials, type of paintings, etcetera. Of course, literature, for example, as as modeled in Fiaf. And in the Netherlands, is a very interesting source collecting information about artists, museums, owners, etcetera. Right? So all this information provides a way of integrating data and at the same time providing additional backgrounds information. Okay, so given these two things, connecting inside and connecting, adding external information to the inside. How to do that? Well, very good news that since, since a while now, there is a community effort in this domain, on a shared data model. And they call this linked art. And this is a very nice initiative because what it does, it really tries to find a sweet spot, on top of a very expressive model, which is called CDOS AM, but which is maybe a bit complicated to use. And what LinkedAR managed to do is really reach the sweet spot that made it possible for organizations to start using to start express all this which which information that they have. And, now here you see a snippet of that. Of course, we're not go gonna go into detail. But I do wanna point out a couple of things here. So for example, the reference to an AT concept here and the reference to a place. And And also interesting here is the modeling of dates, which actually allows you to model vagueness in dates. So that brings me to the last one is that the quality of data is really a big thing. So a lot of time during this project was actually spent by the data owners in improving their quality. And so in the collection management systems, they often, for example, use not complete dates. And this this is the case because they don't they don't know the exact exact date. It's either in a period that is made or they don't know exactly when it started or ended. And by allowing them to actually, model this fakeness, we can then start doing things like sorting updates, which is of course not possible if you don't have a well formed date. But there are various other issues in data quality as well. Now what we notice in this project is, expressed here by this, by this quote. So you can read it yourself. So what really happened is that once they saw information, their information being used on the web and seeing, hey. This is actually complete or this is wrong. That really was a big incentive to start improving the data. One of the examples, if you then have good data, you have it connected to external authorities. For example, here in for wide, you see these these filters on on the left side that you're obviously familiar with from all kinds of search applications. Now here, this gives a very nice overview of the high level what kind of different types of objects there are. If you've seen any website that aggregates, especially culture data from different sources, usually these things are a mess, Right? So what we do here, we use controls for gamblers for all of that. Meaning also that if you don't use them, you will not end up in these filters. But we provide some sort of flexibility because although we show these high level categories here, which was one of the wishes of the users, We allow also institutions to provide many more specific things. But by using the relations in this thesaurus, we can then provide the level that we need here in the interface. So we use the background knowledge for that. All right. Let's come back to this picture. So we've seen now, coming from the right side, that we start to understand the search tasks that are involved here. We have seen how organizations can capture their knowledge, and they've actually been doing that themselves. Right? So this is not that we start harvesting their data and do this. They actually have been doing this themselves, which was really cool for us. But clearly in this picture, there's there's a gap in the middle. Right? So how are we going to solve the search task using using this knowledge graph? That brings me to this part. And, we obviously, we need some sort of API, right, that goes to the website. And but what happens before that is what we call relevance models. And I'll explain to you why we call it relevance models. Because what it has to do with for us is actually three type of queries. And if you're familiar with with graph data, you're familiar with the first Right? So structured graph queries, for example, give me all the artworks, and and sort them by by the production date. Now that's a very valid question. But in applications like this, there's usually a full text component as well. So what about the documents that mentioned for folks health? And in fact, in most cases, they combine these things, right? So there is structured and unstructured information combined, right? So in particular, this unstructured part, we're starting to deal with relevance, right, aboutness. It's not just true or false. And what I like to show you is how we solve these things in SpeedDesk. So what we're trying to do is to really allow people to create these relevance models themselves. So what you should see now is, is being desk, which should be run as a as a cloud service. And, here, the the full API of the of the application is, shown here. This is basically the whole API, of the application. And for each endpoint, they are implemented as what we call strategies or in other words, relevance models. And what I want to do with you is to actually create one. Not exactly what we use in these applications, but just to illustrate how we do that. And we do that in a visual programming interface. So here on the left side, we have a library of building blocks. And what we can do is we can drag those blocks onto the convos, and there we can start creating relevance models. So to start with, I'm just gonna take all the data that we have. So basically you can say this is this is the graph that we have. And what I want to do here is I want to make a search engine for all the letters that Verkhof wrote. So I'm not gonna take all the data, but actually dragged in another block. And I'm going to filter my data on messages. So as you notice here, these are modeled with schema dot org. So I select the messages. Now I can inspect the output here of this block. And we see here on the right side information. Let me increase this a little bit. So here are, the number of letters. Now this is not a lot. This is nine hundred three. But let's let's create a search engine for this. For example, we're using the text of those letters. So what I can do is I can actually extract this text. There we go. And I configured this to actually take the text that we want to use. And now we can say, let's build a document search engine for this. So this is a particular relevance model. And in fact, this is actually the model that is used by by most, off the shelf search engine systems like Solr, Elasticsearch. So, basically, what we're doing, we're building that here on the spot. So we just miss one component here, namely the input, And let's say for now that we want to search for mental health. Maybe we configure our search engine a bit. I know that we're talking about English here, so let's apply some stemming. And now the magic happens because when I start inspecting the outputs, what the system does for you is actually create the indexes that are required. Right? So and in this way, you as a user don't need to think about what are the the technical aspects that I need to realize, what kind of index do I need. But you can think at a much higher abstraction level, what should my relevance model actually look like. And what you see now that we actually find all kinds of results, and these are ranked as you can see here in this probability distribution. And at the beginning we see here, maybe we're not maybe we're actually not gonna expect these results, but what if we start analyzing them? So we go sort of back to our graph. And let's say now we're interested in which periods these letters were written. So I'm going to extract actually the date that they were sent. There we go. And here we are at eighteen eighty nine and eighteen eighty eight is the most relevant years. Now it turns out that actually cut off his ear, in December eighty eight. So it's not surprising that around this time, he was writing mostly about about this mental health. We can also do something else and say, hey, let's now look to something completely different. So from those letters, let's move to the artworks. And the artworks that he has mentioned in those letters. So what are actually the artworks most involved in this whole topic of mental health health? Now this is probably a bit difficult to read for you. On the website they're nicely formatted. But here you see that painting of Madame Goulain, which was actually painted at the end of eighty eight. And here's another painting of of the sunflowers all sort of in that that period. Now I hope this gave you an idea how you can play with these things, create relevance models over over both the text and the structured structured part. If I am correct, I have, like, one minute left. So let's briefly then look at how we are doing this. So if you're sort of in the in the knowledge graph domain, you're you're familiar with this picture. Right? So what we have at the bottom, oh, sorry. At the top, the top of the iceberg is some sort of API that is used by, by an application. Underneath that, there is some sort of graph database and and a graph query language. And what's what we find very interesting is to look at what are now the rules that are needed to solve these things. Right? We need some developer to create these things. And this is typically, yeah, just below the surface, just above the surface. Now if you need full tech support, then typically this is added on the site. And although there are solutions here, it's not very easy to combine these things. And what you need of course is someone that now has knowledge of both these things. So what we're trying to do, we actually push the technology all the way down. So at the lowest level, we actually implemented these things in one system, which is a probabilistic graph database. On top of that, we have a probabilistic relation to algebra that can deal with these things. And if you're interested in that, you can read about that in the literature . Oh, sorry about that. But most importantly for us is that all of this is now under the surface. But above the surface, we now have a way that we can support information specialists to deal with accessing knowledge graphs and text in the same same way to create relevance models that are needed for, for an application. And that is what I just just showed to you. So to wrap this up, a lot of knowledge potential in corporates organizations. But for that, they really need to understand the users. They need to capture their knowledge and finally model the relevance that is needed for the applications. Great. Thanks. Thanks, Miguel. Well, great, great slides. We have some some questions from, people, but, you know, I'll seamlessly take advantage of my position here, and I'll I'll make the the first question because, well, you you triggered my interest with something you said. So you mentioned you're using a probabilistic graph database. I'm supposed to be the expert on graph databases, but I've never heard about it. Would you like to say, like, a couple of words of What it is? Who built it? How it works? Yeah. So so the work originated actually in database or actually to be more precise is the merger of two fields, relational databases and information retrieval. At the end of the 1990s, work was done there. And And basically what it means is adding a score column to, to a triple or quadruple. So we have lifted it from the database world to, to the graph, world. So, where we add scores. And now what do you do with these scores? The interesting thing is that the research that I showed you there, there are various there is an algebra to deal with these scores. Right? How how to combine them, how to add them, how to multiply them for for different operations. So at the lowest level, there is actually graph scores, but more importantly is at the top level is then how you how you use those scores for certain operations. Okay. Okay. Well, yeah, you you provided the reference, and I guess, I or anyone else who's interested will will have to look it up. But, yeah, it's it's a very interesting concept. And, let's see what people have been asking. K. Another question is, which is very specific I guess, what is the rank by text block? And I get it's tied to one specific slide you had. Yeah, yeah. So I use the rank by text or more specifically, I use the rank by BN twenty five, which is a relevance model. And so so this is used by Elasticsearch as well. And, what it does, it implements this for for you. Right? So the the actual query that you need, is implemented in that path. So basically, you can grab whatever entities you have in your Knowledge Graph and say, I need this text and sort of throw it in Elasticsearch as you want. But the nice thing is you don't need to because the system does it for you. So we actually create the indexes that you need to create that search engine. So it all runs into the same system. Okay. Well, like many people are saying in in the comments, that sounds really, really cool, actually. Another question and again from from me, you mentioned that certain vocabulary at some point linked the art, if I recall, And you said it's kind of good, sweet spot, middle ground, between, different expressivity, methods. And you also mentioned that it allows you it's kind of it allows to deal with vagueness and specifically vagueness in dates. So would you like to expand a little bit on the expressivity part and then maybe specifically on the on the vagueness? Yeah. Yeah. So what I specifically said is that it finds the right sweet spot between expressivity and ease of use. And so you could almost position it between, schema dot org, which is relatively easy to use. But for something rich and heterogeneous as we needed it for cohort wide, it was it was just not enough. And at the other hand, there is something known as CDOC CRM, which is an event based model, which allows you to model a lot of stuff. But, to figure out how to use it is a bit complicated. So what Linked Art has done is what they call an application profile. So under the hood, they actually use Cedarc Serum, the user classes, the user relations, the actual stuff. But they created what they call an application profile in JSON LD. So you can actually write it down quite simple in simple terms. And this is a community effort. So it's full of documentations, the patterns that you need come from actual use cases from actual institutions. And, we had we had some discussion with them. There were a couple of things that that we needed and things were changed. So this is still ongoing, but this really suited our needs. So if that would not have been that this this would be quite a quite a drama to to do. So, so that that's that sweet spot. And the other question, yeah, about the dates. And so in this domain, people say, late late autumn, eighteen eighty eight or October nineteen hundred. And what it allows you to do is basically define the vagueness, of a period. So there are things like the begin of the begin, the end of the begin, the beginning of the end, and the end of the end. And so you describe vagueness of periods where the where but you use actual excess dates. So for a system, you now have proper dates that you can use. They might not be the exact date, but at least you can, for example, sort on something. And typically this is accompanied then by textual description, something like late autumn eighty eight, which you can display in the interface. So it sort of gives you the best of both worlds. Okay. Yeah. I don't know. I mean, both of those things that you described, well, the, the way that, people have worked with elite, art vocabulary to me sounds, you know, exemplary, basically. So making it easy for, developers to use, by by leveraging JSONRT and doing these different profiles that you mentioned. And then on the dates, this is, like, a, you know, notoriously difficult issue, how to manage overlapping dates and even more back dates. So if they manage to to address that, that's that's super cool. Yeah. Yeah. Of course, they need to create this data. Right? And, what you saw in this project is that the the larger institutions like the Hoch Museum, the Rijksmuseum, they were doing these things themselves. So they have their own pipelines for creative data mappings. For smaller institutions, we actually help them with it. I mean, smaller in sense of for whole, right? So people providing like ten artworks. So what I didn't show you that in Spring Desk, there is a part where you can actually create those mappings as well. So we help them with that part. Okay. Let's see. I think we may have one last question. I'm getting to actually show. Says, technically, using the SPYNC tool requires to upload data into a proprietary database. Yes. I mean, we're coming a bit from the search area. So often we actually call it an index. Yeah. Right. So it's sort of a layer on top of your data. So we're not the data management system. We interface or we connect with existing systems. So, yeah, but that is required. So we're not doing federated search. That that that that is clearly, something different. Okay. Yeah. That's that's that's clear. Alright. Well, thanks, thanks once again, to you, Michiel, and to everyone who attended. We'll have to wrap up here so we can move to the next session. So, see you there, and see you also in the next session. Bye for now.",
  "language": [
    {
      "id": "http://vocab.getty.edu/aat/300388277",
      "type": "Language",
      "_label": "English"
    }
  ],
  "created_by": {
    "id": "https://example.org/cdkg/Creation/presentation/38",
    "type": "Creation",
    "caused_by": [
      {
        "id": "https://example.org/cdkg/Activity/presentation/38",
        "type": "Activity",
        "_label": "Presentation of \"Van Gogh Worldwide: Constructing and searching a knowledge graph of linked art\""
      }
    ]
  },
  "digitally_carried_by": [
    {
      "id": "https://example.org/cdkg/DigitalObject/recording/38",
      "type": "DigitalObject",
      "_label": "Recording of \"Van Gogh Worldwide: Constructing and searching a knowledge graph of linked art\""
    }
  ]
}